#Merge Dataframes

If the indices are different, then concat will create new rows with those indices, which can lead to duplicate rows or missing data. merge allows to join DataFrames on any columns, regardless of the indices.

In [238]:
import pandas as pd

In [239]:
data1=pd.DataFrame({"City": ['kathmandu', "Damak", "Beni"],
            "Temperature":[23,34,45]})
data1

        City  Temperature
0  kathmandu           23
1      Damak           34
2       Beni           45

In [240]:
data2=pd.DataFrame({"City": ['Damak', "Beni", "Taplejung"],
       "Temperature":[34, 45, 20]})
data2

        City  Temperature
0      Damak           34
1       Beni           45
2  Taplejung           20

***inner: intersection, outer: union, left: B complement, right: Acomplement***

In [241]:
pd.merge(data,data1)  #only common data prints by default

        City  Temperature
0  kathmandu           23
1      Damak           34
2       Beni           45

In [242]:
df=pd.merge(data,data1, how='outer')
df

        City  Temperature
0  kathmandu           23
1      Damak           34
2       Beni           45

In [243]:
pd.merge(data1,data2, how="right")

        City  Temperature
0      Damak           34
1       Beni           45
2  Taplejung           20

In [244]:
#adding humidity
data3=pd.DataFrame({"City": ["Kathmandu","Beni","Taplejung"],
                    "Humidity":[12,20,14]})
data3

        City  Humidity
0  Kathmandu        12
1       Beni        20
2  Taplejung        14

In [245]:
df2=pd.merge(df,data2, how='outer')
df2

        City  Temperature
0  kathmandu           23
1      Damak           34
2       Beni           45
3  Taplejung           20

In [246]:
#indicating datas, if the data came from left or right data,, using indicator
#here left denotes data1, right denotes data2
#both means data is present in both data1 and data2
df3=pd.merge(df,data2, how='outer', indicator="true")
df3

        City  Temperature        true
0  kathmandu           23   left_only
1      Damak           34        both
2       Beni           45        both
3  Taplejung           20  right_only

***Suffixes***

In [247]:
data1=pd.DataFrame({"City": ['kathmandu', "Damak", "Beni","Taplejung"],
            "Temperature":[23,34,45,12],
            "Humidity":[12,11,10,9]})
data1

        City  Temperature  Humidity
0  kathmandu           23        12
1      Damak           34        11
2       Beni           45        10
3  Taplejung           12         9

In [248]:
data2=pd.DataFrame({"City": ["Damak","Syanja","kathmandu"],
                    "Temperature":[33,27,12],
                    "Humidity":[12,14,23]})
data2

        City  Temperature  Humidity
0      Damak           33        12
1     Syanja           27        14
2  kathmandu           12        23

In [249]:
pd.merge(data1,data2,on="City") #x and y denotes data of data1 and data2

        City  Temperature_x  Humidity_x  Temperature_y  Humidity_y
0  kathmandu             23          12             12          23
1      Damak             34          11             33          12

In [250]:
pd.merge(data1,data2,on="City",suffixes=('_data1', '_data2'))

,City,Temperature_data1,Humidity_data1,Temperature_data2,Humidity_data2
0,kathmandu,23,12,12,23
1,Damak,34,11,33,12